<template>
  <ul class="nav">
    <li class="nav-item">
      <h2>一.服务提示</h2>
      <p>
        本服务条款系由用户与弘宝网络科技有限公司（以下简称弘宝网络）就弘宝网络科技有限公司所属的线上游戏平台《掼弹世界》及其所属线上游戏所订立的相关权利义务规范。
        因此，请在注册成为《掼弹世界》用户前，详细阅读本服务条款的所有内容，当您点选同意键或执行《掼弹世界》线上游戏即视为同意接受本服务条款的所有规范并自愿接受其约束。
        用户的使用行为将被视为用户对本服务的全部条款的完全接受，包括接受弘宝网络对服务条款随时所做的任何修改。如发生纠纷，用户不得以未仔细阅读本服务条款为由实行抗辩。
      </p>
    </li>
    <li class="nav-item">
      <h2>二.用户准则</h2>
      <ol>
        <li>
          用户应遵守中华人民共和国相关法律、法规、规章以及其他规范性文件的要求；遵守与网络服务有关的网络协议、规定和程序；
          遵守本服务条款以及弘宝网络相关规定；不从事任何损害国家、弘宝网络以及其他用户的合法利益的行为
        </li>
        <li>玩家之间人人平等，这是平台对玩家进行服务的准则。我们努力使每个玩家获得同等质量的服务，玩家也应该做到尊重其他玩家的权利，不进行任何可能会侵害其他玩家游戏质量的活动。</li>
        <li>
          游戏中注意言行举止，礼貌用语。用户独立承担其在接受平台服务过程中发布信息所可能产生的法律责任，不得发布任何虚假性、骚扰性、侮辱性、恐吓性、伤害性、破坏性、挑衅性、庸俗性、
          淫秽色情性等内容的非法信息，不得发布违背公序良俗的信息。《掼弹世界》游戏管理人员有权利在获得举报后采取禁言等措施进行管理。
        </li>
        <li>
          公平游戏是享受游戏的前提，众所周知，任何程序都存在 BUG ，虽然我们已经解决了所有已知的 BUG ，但是不能排除其他 BUG 存在的可能性。作为游戏玩家，
          应该能够在发现 BUG 时主动向《掼弹世界》管理人员汇报或者在弘宝网络官方网站相关页面提交问题。严禁利用任何 BUG 进行非正常性的获利，这些获利包括但不限于获得额外的虚拟货币（金币、游戏豆），
          道具物品等。一经发现，《掼弹世界》客户服务部门将有权利对该玩家处以停权、关闭账号等处罚。
        </li>
        <li>玩家应该自觉不参与以真实货币或者物品换取虚拟物品或游戏账号的交易行为，弘宝网络将不对这一类交易中产生的任何问题进行支持或者保障。</li>
        <li>为了保证游戏公平性，《掼弹世界》管理人员将不会介入到任何玩家之间纠纷。</li>
        <li>每个玩家均有请求游戏管理人员帮助的权利，但是，为了能够让更多的人获得帮助，每个玩家应该自觉不与游戏管理人员闲聊。游戏管理人员有权利不回答与工作无关的闲聊话题。</li>
        <li>每个玩家均有监督游戏管理人员的权利，如果玩家发现游戏管理人员任何违规行为，均可截图后登录弘宝网络官方网站进行投诉，我们将在第一时间进行处理。</li>
        <li>异常注册、异常登录（如利用非法的软件、外挂进行注册与登录）的账号会被列入掼弹世界黑名单中，由此产生的全部后果均由用户承担。</li>
      </ol>
    </li>
    <li class="nav-item">
      <h2>三.用户账号规则</h2>
      <ol>
        <li>
          用户可选择弘宝网络的保护服务保障其账号安全，并承诺按照弘宝网络的要求提供准确、真实、完整的个人注册信息，选择保护服务时应按照弘宝网络的要求填写身份证、
          护照等可明确身份的证件号码，弘宝网络以身份证作为判断账号使用权归属的最终依据。弘宝网络认为必要时，有权要求用户提供国家相关机关的书面证明文件或公证机关的公证书以证明其身份证件的真实性，
          由此所产生的通讯费、邮寄费、交通费等一切费用均由用户自行承担。当用户个人资料发生变更（用户推迟更新或伪造虚假个人注册信息）导致影响弘宝网络对该用户提供服务，产生的全部责任均由用户承担。
        </li>
        <li>账号或昵称的注册须遵守公共秩序和良好风俗；不得有明确或者隐含非法、骚扰性、侮辱性、恐吓性、伤害性、破坏性、挑衅性、庸俗性、淫秽色情性等内容的文字以及其他侵犯他人合法利益和人格尊严的文字。</li>
        <li>
          弘宝网络的服务由弘宝网络根据实际情况提供，包括但不限于线上游戏、网上论坛、聊天室、合作商增值服务等。在某些情况下，弘宝网络许可用户以其平台账号登录或使用弘宝网络合作方运营的产品或服务。
          弘宝网络仅提供相关的网络服务,除此之外与相关网络服务有关的上网设备(如电脑、调制解调器及其他互联网接入装置)及所需的费用（如为接入互联网而支付的电话费、上网费）均应由用户自行负担。
        </li>
      </ol>
    </li>
    <li class="nav-item">
      <h2>四.用户保管账号及密码的义务</h2>
      <ol>
        <li>
          用户有义务妥善保管在注册并使用《掼弹世界》时获得的账号及密码，并为此组账号及密码登录系统后所开始的一连串行为或活动负责。任何以用户账号所进行的网上操作均视同为用户的有效操作行为，
          由此完成的网上操作指令的结果、网上在线的结果或由此造成的损失，由用户承担全部责任。
        </li>
        <li>
          因非弘宝网络原因导致账号密码丢失或被盗以及造成其他损失，均由用户承担责任，弘宝网络概不负责。用户发现其账号被他人非法使用，应立即通知弘宝网络，
          并根据弘宝网络的要求提交其拥有该账号使用权的证明及其他材料。弘宝网络有权封存该账号以保障用户的权利。
        </li>
        <li>用户向弘宝网络查询、修改或重置其账号密码时，必须提供完全准确的个人注册信息（包括注册时间），否则弘宝网络有权本着为用户保密的原则不予告知。用户可以更改账号的密码，也可以申请新账号，但不可以要求删除旧账号。</li>
      </ol>
    </li>
    <li class="nav-item">
      <h2>五.用户责任及行为制约</h2>
      <ol>
        <li>
          《掼弹世界》严禁用户利用线上游戏的机会做与游戏无关的行为，包括但不限于妨害他人名誉或隐私权；使用自己、匿名、冒用他人或以平台名义散播诽谤、不实、威胁、不雅、猥亵、不法、
          攻击性及侵害他人权利的消息或文字，传播色情或其它违反社会公德的言论；传输或散布计算机病毒；从事广告或贩卖商品；从事不法交易或张贴虚假不实或引人犯罪的信息；或任何违反中华人民共和国法律或其它法律、
          法规的行为，亦不得利用线上游戏的机会，与其它用户或他人进行非法的交涉或对话。
        </li>
        <li>
          用户对《掼弹世界》游戏管理人员所进行的询问应据实澄清，否则《掼弹世界》有权随时终止用户使用线上游戏，或采取禁止发言甚至封闭账号等一系列处罚措施；《掼弹世界》管理人员发现不法或可疑的行为者，
          弘宝网络有权随时通报司法或有权机关处理，并有权同时向该机关陈报用户的基本资料及行为供该等机关为调查。用户就因此所产生的不便或困扰，不得向弘宝网络请求任何补偿。
        </li>
        <li>用户应就其在线上游戏的行为或活动自负责任，弘宝网络（《掼弹世界》）仅提供线上游戏予用户自行执行或与其它用户依照游戏设定的方式进行竞赛或游戏。弘宝网络（《掼弹世界》）就用户在线上游戏的行为或活动或交易不负任何责任。</li>
        <li>用户承诺在发现《掼弹世界》可能存在系统漏洞时，须及时告知弘宝网络，并不得从事任何利用系统漏洞的行为。</li>
      </ol>
    </li>
    <li class="nav-item">
      <h2>六.服务的停止和更改</h2>
      <ol>
        <li>
          发生下列情形之一时，弘宝网络（《掼弹世界》）有权停止或中断线上游戏：
          <ol>
            <li>对于《掼弹世界》的网络设备进行必要的保养及施工；</li>
            <li>发生突发性的网络设备故障时；</li>
            <li>由于《掼弹世界》所用的网络通信设备由于不明原因停止，无法提供服务时；</li>
            <li>由于不可抗力因素致使弘宝网络（《掼弹世界》）无法提供线上游戏服务；</li>
            <li>其他一些弘宝网络认为的特殊情况。</li>
          </ol>
        </li>
        <li>
          《掼弹世界》的游戏账号免费提供给用户注册、使用。账号的归属权属于弘宝网络。用户出现以下情况弘宝网络有权收回账号重新安排账号资源的使用：
          <ol>
            <li>账号长期不使用；</li>
            <li>账号违反《掼弹世界》相关规定。 回收后的账号将清除所有该账号的信息和附带的虚拟财富，由此带来的损失由用户自行承担。</li>
          </ol>
        </li>
      </ol>
    </li>
    <li class="nav-item">
      <h2>七.平台权利</h2>
      <ol>
        <li>
          掼弹世界的所有权和经营权归弘宝网络所有。弘宝网络提供的服务内容包括但不限于文字、软件、声音、图片、动画、录像、图表等。此所有内容均受著作权法、商标法以及其他有关财产权法律的保护。
          未经弘宝网络或者其他相关权利人授权，用户不得复制、使用、修改、摘编、翻译、发行这些内容或创造与该内容有关的派生产品。
        </li>
        <li>弘宝网络有权制定其游戏产品的游戏规则；弘宝网络有权对用户进行管理，可以通过技术手段查处作弊以及其他违规行为。</li>
        <li>
          用户承诺授权弘宝网络复制、使用、修改、摘编、翻译、发行其提供至弘宝网络系统的原创作品，并许可弘宝网络将其作品免费用于弘宝网络相关媒体,用户通过版权声明排除该授权除外。
          弘宝网络相关媒体包括但不限于弘宝网络所有网站（包括弘宝网络与其他网站合办的栏目）、刊物等。
        </li>
        <li>
          如用户注册后在游戏规定时间没有进行账号登录，且用户账号上没有会员资格与金币，弘宝网络有权收回和处分该账号的使用权；对于该账号上附随的游戏数据、虚拟财产以及其他平台产品和服务等，弘宝网络不承担返还、退费、赔偿或补偿等任何形式的责任。
          上述游戏数据、虚拟财产以及其他产品和服务包括但不限于金币、游戏豆、掼弹秀等。
        </li>
        <li>弘宝网络有权调整其服务的收费标准，并保留对提供给用户的免费服务项目收取相应费用的权利，如用户拒绝按收费标准交费，则弘宝网络不再提供相应的服务。</li>
        <li>如用户账号内的金币涉及非法取得，或属不当得利的，弘宝网络有权对该账号采取收回或扣除金币、封闭账号、终止服务等处罚措施，前述处罚措施可以并用，并不负在处罚前通知用户的义务。</li>
      </ol>
    </li>
    <li class="nav-item">
      <h2>八.隐私权保护</h2>
      <ol>
        <li>
          保护用户（特别是未成年人）的隐私是《掼弹世界》的一项基本政策，因此，若父母（监护人）希望未成年人得以使用本服务，必须以父母名义申请注册，在接受本服务时，应以法定监护人身份加以判断本服务是否符合未成年人。
          《掼弹世界》保证不对外公开或向第三方（本条所列情况除外）提供用户注册资料及用户在使用网络服务时存储在《掼弹世界》的非公开内容，但下列情况除外：
          <ol>
            <li>事先获得用户的明确授权；</li>
            <li>根据有关的法律法规要求；</li>
            <li>按照相关政府主管部门的要求；</li>
            <li>为维护社会公众的利益；</li>
            <li>为维护《掼弹世界》的合法权益；</li>
          </ol>
        </li>
        <li>《掼弹世界》可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与《掼弹世界》同等的保护用户隐私的责任，则弘宝网络《掼弹世界》可将用户的注册资料等提供给该第三方。</li>
        <li>
          在不透露单个用户隐私资料的前提下，弘宝网络有权对整个用户数据库进行技术分析并对已进行分析、整理后的用户数据进行商业上的利用。尽管弘宝网络对用户的隐私权保护做了极大的努力，
          但是仍然不能保证现有的安全技术措施使用户的技术信息等不受任何形式的损失。
        </li>
      </ol>
    </li>
    <li class="nav-item">
      <h2>九.风险承担和责任免除</h2>
      <ol>
        <li>本服务涉及到互联网及移动通讯等服务，可能会受到各个环节不稳定因素的影响。因此服务存在因上述不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机、互联网络、
          通信线路原因等造成的服务中断或不能满足用户要求的风险。开通服务的用户须承担以上风险，弘宝网络和合作公司对服务之及时性、安全性、准确性不作担保，对因此导致用户不能发送和接受阅读消息、
          或传递错误，个人设定之时效、未予储存或其他问题不承担任何责任。
        </li>
        <li>用户同意使用《掼弹世界》是出于用户个人意愿，并愿自负任何风险，包括但不限于其因执行《掼弹世界》或自行由《掼弹世界》官方网站下载游戏或资料图片而导致用户或其所使用的计算机系统损害，或发生任何资料的流失等。</li>
        <li>弘宝网络不负任何明示或默示的担保责任，亦不保证《掼弹世界》的稳定、安全、无误及不中断。用户应自行承担执行线上游戏所有的风险及因此可能导致的损害，包括而不限于其因执行线上游戏《掼弹世界》或自行由《掼弹世界》
          官方网站下载游戏或资料图片而导致用户或其所使用的计算机系统损害，或发生任何资料的流失等。</li>
      </ol>
    </li>
    <li class="nav-item">
      <h2>十.纠纷处理规定</h2>
      <ol>
        <li>用户游戏数据的使用权归属等存在争议，可以通过弘宝网络网站或弘宝网络提供的其他方式请求弘宝网络客户服务人员处理。</li>
        <li>用户承诺遵守弘宝网络处理此类事务的要求、流程，对自己的主张提供相应的材料予以证明。如用户不能提供充分材料证明其主张成立，致使其受到损害，则由用户独立承担全部责任。</li>
        <li>用户同意以弘宝网络系统所记载的数据作为处理用户之间或用户与弘宝网络之间纠纷的判断标准。用户自行承担其因处理此类纠纷而产生之通讯费、邮寄费、交通费等一切费用。 </li>
        <li>用户若违反本服务条款或弘宝网络相关规定，导致弘宝网络、受雇人、受托人、代理人、其它相关履行辅助人或其他用户因此而受到损害，用户应负担损害赔偿责任。</li>
      </ol>
    </li>
    <li class="nav-item">
      <h2>十一.版权声明</h2>
      <ol>
        <li>《掼弹世界》的所有相关著作权、专利权、商标、营业秘密及其它任何所有权或权利，均属弘宝网络科技有限公司或其原始授权人所有。非经弘宝网络科技有限公司或原始授权人的同意，
          任何人或用户均不得擅自下载、重制、传输、改作、编辑于任何为线上游戏目的以外的使用或任何以获利为目的的使用，否则应负所有法律责任。 </li>
        <li>《掼弹世界》网络游戏运营过程中产生并储存于《掼弹世界》数据库的任何数据信息（包括但不限于账号、游戏豆、金币、积分、级别等游戏数据）的所有权均使属于弘宝网络（《掼弹世界》），
          用户在按照本服务条款正常使用《掼弹世界》网络游戏的过程中对属于其用户账号的数据信息享有有限使用权。</li>
      </ol>
    </li>
    <li class="nav-item">
      <h2>十二.补充规定</h2>
      <ol>
        <li>弘宝网络保留随时修改或补充本服务条款的权利，修改或补充本服务条款时，弘宝网络将以公告的方式通知用户，而不另对用户进行个别通知。若用户不同意修改或补充的内容，可停止使用弘宝网络的服务，
          弘宝网络不承担返还、退费、赔偿或者补偿等任何形式的责任。若用户继续使用弘宝网络的服务，即视为用户已接受弘宝网络所修改或补充的内容。 </li>
        <li>弘宝网络相关规定与用户服务条款具有同等效力，共同构成双方对本服务之约定事项及其他有关事宜的完整协议，用户应一并遵循。</li>
        <li>如本服务条款中的任何条款完全或部分无效，本服务条款的其余条款仍应有效且具有约束力，用户承诺努力使该条款所反映的双方意向具备效力。</li>
        <li>其他一些规定如《掼弹论坛服务条款》、《掼弹聊天室服务条款》、《掼弹世界游戏作弊处罚规则》。</li>
        <li>本服务条款的最终解释权归弘宝网络科技有限公司所有。</li>
        <li>本服务条款自2010年6月20日起正式施行</li>
      </ol>
    </li>
  </ul>
</template>

<script>
export default {
  name: 'service-terms'
}
</script>

<style lang="stylus" scoped>
.nav
  .nav-item
    display: block
    margin-bottom: 10px
    p
      line-height: 20px
      text-indent: 2em
    h2
      margin: 10px 0
    ol
      padding-left: 20px
      li
        line-height: 20px
        ol
          list-style-type: square
</style>
